Revit 2022 API
LinkOriginFileType Enumeration
 Enum determining whether the source type of a temporary rvt link is an ifc or axm file
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2022
Since: 2022
Syntax
C#
public enum LinkOriginFileType
Visual Basic
Public Enumeration LinkOriginFileType
Visual C++
public enum class LinkOriginFileType
Members
Member name | Description
RVT |  Default RVT, curently only support ifc and axm.
IFC |  The original link file is an ifc file.
AXM |  The original link file is an axm file.
See Also
Autodesk.Revit.DB Namespace